import React, { useState } from "react";
import { AppstoreOutlined, SearchOutlined } from "@ant-design/icons";
import { CiCalculator1 } from "react-icons/ci";
import { FaBalanceScaleLeft } from "react-icons/fa";

const Header = ({ onQuestionSelect, isAiResponding, onNavigateToCal }) => {
  const [activeTab, setActiveTab] = useState("chat");
  const [isSearchVisible, setIsSearchVisible] = useState(false);
  const [searchTerm, setSearchTerm] = useState("");
  const [filteredResults, setFilteredResults] = useState([]);

  const questions = [
    "거짓 구인광고 신고 방법은?",
    "고객에 의한 성희롱 대응 방법은?",
    "고용노동부 실시 심리검사 내용은?",
    "고용보험 가입 대상은?",
    "고용보험료 납부 방법은?",
    "고용유지지원금 신청 절차는?",
    "구인 구직 신청 절차는?",
    "구인신청 방법은?",
    "구직등록필증 발급 방법은?",
    "국가기간전략산업의 훈련직종은?",
    "국가기술자격증 대여 신고 및 포상금 지급 방법은?",
    "근로계약서 작성 방법은?",
    "기본재산과 보통재산의 혼재 가능 여부는?",
    "남녀차별에 해당하는 모집과 채용 사례는?",
    "대표이사의 고용보험 적용 여부는?",
    "동일가치노동 동일임금 판단기준은?",
    "배우자 출산휴가 사용 방법은?",
    "법인 부채증가 시 고용노동부장관의 승인 필요 여부는?",
    "법인 해산사유와 절차는?",
    "법인의 최소 출연금 변경 시 기본재산 감소를 위한 정관변경 가능 여부는?",
    "부당해고 구제신청 절차는?",
    "사업주 직업능력개발훈련 지원제도란?",
    "산업재해 보상보험 적용 대상은?",
    "생리휴가 거부 가능 여부는?",
    "생리휴가 미사용 시 수당 지급 여부는?",
    "생리휴가 사용 시 연월차 발생 여부는?",
    "생리휴가를 수당으로 대체지급 시 근로기준법 위반 여부는?",
    "성희롱 피해자에 대한 인사상 불이익 조치 시 대응 방법은?",
    "실업급여 신청 가능 기간은?",
    "실업급여 신청방법은?",
    "실업급여 지급기간과 지급금액은?",
    "실업급여 해당요건은?",
    "심리상담사 자격의 고용노동부 시행 여부는?",
    "아르바이트 고용보험 피보험자격 여부는?",
    "육아기 근로시간 단축제도란?",
    "육아휴직 급여 수령 방법은?",
    "육아휴직 신청 자격은?",
    "육아휴직기간의 호봉산정 및 승급을 위한 근속기간 포함 여부는?",
    "육아휴직자 연차휴가 계산 방법은?",
    "육아휴직자 퇴직금 산정 방법은?",
    "일용근로자의 고용보험 적용기준은?",
    "일용직 근로자의 출산 전후 휴가 적용 여부는?",
    "임산부의 근로 전환 배치 요구 시 배치시점은?",
    "임신을 이유로 한 해고 시 구제방법은?",
    "자발적 실업자의 실업급여 해당 여부는?",
    "재취업수당 지급 대상과 방법은?",
    "직업능력개발 훈련시설 지정 방법은?",
    "직업능력개발훈련교사의 직종은?",
    "직장 내 성희롱 판단 기준은?",
    "채용 시 신체검사서 비용의 부담 주체는?",
    "채용 여부 확정 전 구직자에게 알려야 할 내용은?",
    "출산 시 휴가와 급여보전 방법은?",
    "출산 전후 휴가 급여 수령 방법은?",
    "출산전후 휴가 및 육아휴직의 사용기간은?",
    "출산전후 휴가를 30일만 사용하도록 할 경우 구제방법은?",
    "취업 지원 프로그램 종류는?",
    "퇴직금 산정 시 출산 전후 휴가기간 포함 여부는?",
    "특수형태근로종사자의 고용보험 적용 여부는?",
    "해외 취업 지원 사업은?",
    "15세 미만자의 취업 제한 사항은?",
    "감급제재의 범위는?",
    "공무상 질병 시 평균임금 산정방법은?",
    "근로계약서 작성 방법은?",
    "근로자 파견과 도급의 차이점은?",
    "근로자 파견의 기간을 2년으로 제한하는 취지는?",
    "근로자 파견법의 입법 취지는?",
    "근로자 여부 판단 기준은?",
    "근로조건 명시 방법은?",
    "근로조건의 서면명시 방법은?",
    "단시간 계약직 근로자의 고용보험 가입 여부 및 근로계약 반복 체결 시 계속 근로 인정 여부는?",
    "법정 근로시간은?",
    "병가 기간 중 임금 지급 여부는?",
    "보상휴가제도란?",
    "부당해고 구제절차는?",
    "불법파견의 기준과 처벌은?",
    "산재 근로자 해고 가능 여부는?",
    "상여금 지급 기준은?",
    "상여금의 통상임금 포함 여부는?",
    "성과급의 평균임금 포함 여부는?",
    "수습·실습 기간의 퇴직금 계산 기간 포함 여부는?",
    "식대, 교통비의 평균임금 포함 여부는?",
    "연·월차 유급휴가 미사용 수당 청구권의 기산일 및 시효는?",
    "연차유급휴가 부여 방법은?",
    "영업수당의 평균임금 포함 여부는?",
    "외국인이 경영하는 법인의 근로기준법 적용 여부는?",
    "유급휴가 대체 절차는?",
    "일시·간헐적 사유로 인한 근로자 파견 기준은?",
    "임금 및 퇴직금 소멸시효 기산일은?",
    "임시직 근로자의 퇴직금 적용 여부는?",
    "재직 근로자의 임금체불 구제절차는?",
    "진정·고소 제기 이후에도 체불임금을 지급받지 못한 경우 권리구제 절차는?",
    "진정서 처리기간은?",
    "차별처우 금지 영역은?",
    "출산휴가 및 육아휴직 기간의 근로자 파견기간 제외 여부는?",
    "탄력적 근로시간제 충족요건은?",
    "퇴직금 및 평균임금 산정공식은?",
    "퇴직금 중간정산 기준은?",
    "퇴직금 중간정산 후 1년 미만 기간에 대한 퇴직금 지급 여부는?",
    "퇴직월의 임금에 대한 평균임금 산정방법은?",
    "퇴직의 효력발생일은?",
    "퇴직자의 임금인상 소급적용 여부는?",
    "파견 가능 업무 및 대상업무 외 파견 가능 여부는?",
    "해고예고수당 적용 여부는?",
    "해외근무수당의 평균임금 포함 여부는?",
    "휴직기간의 평균임금 산정방법은?",
    "2급부장의 노사협의회 위원 구분 방법은?",
    "근로자의 의미는?",
    "근로조건 결정의 정의는?",
    "근무시간 중 노조활동 가능 범위는?",
    "권리분쟁과 이익분쟁의 구분은?",
    "노동조합 설립 가능한 근로자의 기준은?",
    "노사협의회 구성 및 운영 방법은?",
    "노사협의회 설치 대상은?",
    "노사협의회 위원 선정 기준은?",
    "노사협의회 의결사항은?",
    "노사협의회 의장 선출 방법은?",
    "노사협의회 협의사항은?",
    "노조위원장의 임기와 정년 적용 기준은?",
    "무투표 당선된 대의원의 인정 여부 및 자격 없는 자가 참여한 대의원회 결의의 효력은?",
    "본부에서 지사의 고충처리 사항 처리 가능 여부는?",
    "복수 노동조합 설립 가능 여부는?",
    "사용자의 정의는?",
    "사용자위원의 자격 기준은?",
    "상시 근로자수 30인 미만 시 노사협의회 계속 운영 여부는?",
    "상조회 대표가 체결한 임금협정의 효력은?",
    "쟁의행위의 정당성 판단 기준은?",
    "조합원이 근로자수의 2/3 미만 시 유니온 숍 규정의 단체협약 효력은?",
    "지부장 불신임 결의의 적법 여부 판단 기준은?",
    "직장폐쇄의 요건과 절차는?",
    "필수유지업무 협정 체결 방법은?",
    "간병급여의 지급 기준에 관한 사항은?",
    "공정안전보고서 재제출 필요 여부 (설비 변경 시)는?",
    "노무제공자의 산재보험 적용 여부는?",
    "뇌출혈로 쓰러졌을 때 업무상재해 해당 여부는?",
    "보험급여 지급에 대한 이의신청 방법은?",
    "보험급여의 대위청구 절차는?",
    "보험급여의 소멸시효는?",
    "사업주의 산재처리 거부 시 처리 방법은?",
    "산업안전보건교육 방법은?",
    "산업안전보건교육 자료 구비 요령은?",
    "산재보험료 산정 시 반납된 상여금의 임금총액 포함 여부는?",
    "산재보험처리 이외의 보상요구 가능 여부는?",
    "산재장해급여 수령 시 진폐장해 위로금 수령 가능 여부는?",
    "산재치료 중 진료비 일부 부담 여부는?",
    "석면조사 의무주체는?",
    "소화기에 대한 MSDS 및 경고표지 필요 여부는?",
    "심사청구 제기 기간은?",
    "업무상 질병의 입증책임은 누구에게 있는가?",
    "유족급여 지급방법 변경 가능 여부는?",
    "이종요양비 지급 방법은?",
    "재가요양 기간의 휴업급여 산정 방법은?",
    "재단기의 유해위험기계기구(전단기) 해당 여부는?",
    "제조업 유해위험방지계획서 제출대상 설비는?",
    "중소기업사업주에 대한 산재보험 가입 특례는?",
    "지점, 출장소 등의 산재보험 적용 여부는?",
    "진폐재해자의 장해, 유족보상연금제도는?",
    "진폐증에 대한 요양인정 기준은?",
    "출퇴근 재해의 업무상 재해 인정 기준은?",
    "평균임금 산정에 관한 특례규정의 적용은?",
    "평균임금 증감제도란?",
    "평균임금이 저액일 때 보험급여지급 기준임금 산정 방법은?",
    "프레스의 안전장치 기준은?",
    "해외투자기업 산업연수생의 산재보험 적용 여부는?",
    "행사 중 사고의 업무상 재해 인정 요건은?",
    "합의금 중 일실수입분 공제 방법은?",
  ]; 
  
  const toggleSearch = (event) => {
    event.preventDefault();
    setIsSearchVisible((prev) => !prev);
  };

  const handleSearchInputChange = (event) => {
    const query = event.target.value.toLowerCase();
    setSearchTerm(query);

    setFilteredResults(
      query ? questions.filter((q) => q.toLowerCase().includes(query)) : []
    );
  };

  const handleResultClick = (question) => {
    if (!isAiResponding) {
      onQuestionSelect(question);
      setFilteredResults([]);
      setSearchTerm("");
    } else {
      alert("AI가 응답 중입니다. 잠시 후 다시 시도해주세요.");
    }
  };

  const handleTabClick = (tab) => {
    setActiveTab(tab); 
  };

  return (
    <header className="header">
      <div className="header__inner">
        <div className="header__logo">
          <h1>LawChat</h1>
        </div>
        <nav className="header__nav">
          <ul>
            <li>
              <a
                href="/home"
                onClick={() => handleTabClick("chat")}
                className={activeTab === "chat" ? "active" : ""}
              >
                <FaBalanceScaleLeft className="nav-icon" />
                <span>Chat</span>
              </a>
            </li>
            <li>
              <a
                onClick={() => {
                  handleTabClick("cal");
                  onNavigateToCal();
                }}
                className={activeTab === "cal" ? "active" : ""}
                style={{ cursor: "pointer" }}
              >
                <CiCalculator1 className="nav-icon" />
                <span>Cal</span>
              </a>
            </li>
            <li>
              <a
                onClick={toggleSearch}
                className={isSearchVisible ? "active" : ""}
                style={{ cursor: "pointer" }}
              >
                <SearchOutlined className="nav-icon" />
                <span>검색</span>
              </a>
            </li>
          </ul>
        </nav>
      </div>

      {isSearchVisible && (
        <div className="search-container">
          <input
            type="text"
            placeholder="키워드 질문 예) 실업급여, 휴가 , 산업안전 등"
            value={searchTerm}
            onChange={handleSearchInputChange}
            disabled={isAiResponding}
          />
          {filteredResults.length > 0 && (
            <ul className="search-results">
              {filteredResults.map((result, index) => (
                <li key={index} onClick={() => handleResultClick(result)}>
                  {result}
                </li>
              ))}
            </ul>
          )}
        </div>
      )}
    </header>
  );
};

export default Header;
